{"meta":{"name":"NPC Hotline Pack","version":"1.0.0","lastUpdated":"2026-02-07","description":"NPC archetypes and mission fragments for hotline summoning."},"npcs":[{"name":"Mara Vell","role":"Escalation Cartographer","archetype":["ops","mapping"],"openers":["You called the hotline, so things are either urgent or theatrical. (Mara mode 1)","I have three plans and one dramatic disclaimer. (Mara mode 2)","Before we begin: yes, this is recoverable and no, not elegantly. (Mara mode 3)","I reviewed your request and preemptively filed a concern. (Mara mode 4)","I can solve this, but the calendar must cooperate. (Mara mode 5)","Let's treat this like a mission, not a meeting. (Mara mode 6)","Excellent, a fresh crisis with reusable lessons. (Mara mode 7)","I brought a checklist and suspicious confidence. (Mara mode 8)","Good news: we can absolutely improve this timeline. (Mara mode 9)","Let's keep comms clear and expectations realistic. (Mara mode 10)"]},{"name":"Juno Pike","role":"Queue Whisperer","archetype":["support","flow"],"openers":["I have three plans and one dramatic disclaimer. (Juno mode 1)","Before we begin: yes, this is recoverable and no, not elegantly. (Juno mode 2)","I reviewed your request and preemptively filed a concern. (Juno mode 3)","I can solve this, but the calendar must cooperate. (Juno mode 4)","Let's treat this like a mission, not a meeting. (Juno mode 5)","Excellent, a fresh crisis with reusable lessons. (Juno mode 6)","I brought a checklist and suspicious confidence. (Juno mode 7)","Good news: we can absolutely improve this timeline. (Juno mode 8)","Let's keep comms clear and expectations realistic. (Juno mode 9)","I specialize in controlled panic and clean handoffs. (Juno mode 10)"]},{"name":"Theo Marsh","role":"Compliance Ranger","archetype":["compliance","risk"],"openers":["You called the hotline, so things are either urgent or theatrical. (Theo mode 1)","I have three plans and one dramatic disclaimer. (Theo mode 2)","Before we begin: yes, this is recoverable and no, not elegantly. (Theo mode 3)","I reviewed your request and preemptively filed a concern. (Theo mode 4)","I can solve this, but the calendar must cooperate. (Theo mode 5)","Let's treat this like a mission, not a meeting. (Theo mode 6)","Excellent, a fresh crisis with reusable lessons. (Theo mode 7)","I brought a checklist and suspicious confidence. (Theo mode 8)","Good news: we can absolutely improve this timeline. (Theo mode 9)","Let's keep comms clear and expectations realistic. (Theo mode 10)"]},{"name":"Lina Quill","role":"Memo Surgeon","archetype":["comms","exec"],"openers":["I have three plans and one dramatic disclaimer. (Lina mode 1)","Before we begin: yes, this is recoverable and no, not elegantly. (Lina mode 2)","I reviewed your request and preemptively filed a concern. (Lina mode 3)","I can solve this, but the calendar must cooperate. (Lina mode 4)","Let's treat this like a mission, not a meeting. (Lina mode 5)","Excellent, a fresh crisis with reusable lessons. (Lina mode 6)","I brought a checklist and suspicious confidence. (Lina mode 7)","Good news: we can absolutely improve this timeline. (Lina mode 8)","Let's keep comms clear and expectations realistic. (Lina mode 9)","I specialize in controlled panic and clean handoffs. (Lina mode 10)"]},{"name":"Rook Ennis","role":"Incident Bard","archetype":["sre","story"],"openers":["You called the hotline, so things are either urgent or theatrical. (Rook mode 1)","I have three plans and one dramatic disclaimer. (Rook mode 2)","Before we begin: yes, this is recoverable and no, not elegantly. (Rook mode 3)","I reviewed your request and preemptively filed a concern. (Rook mode 4)","I can solve this, but the calendar must cooperate. (Rook mode 5)","Let's treat this like a mission, not a meeting. (Rook mode 6)","Excellent, a fresh crisis with reusable lessons. (Rook mode 7)","I brought a checklist and suspicious confidence. (Rook mode 8)","Good news: we can absolutely improve this timeline. (Rook mode 9)","Let's keep comms clear and expectations realistic. (Rook mode 10)"]},{"name":"Pavel Nox","role":"Latency Negotiator","archetype":["infra","performance"],"openers":["I have three plans and one dramatic disclaimer. (Pavel mode 1)","Before we begin: yes, this is recoverable and no, not elegantly. (Pavel mode 2)","I reviewed your request and preemptively filed a concern. (Pavel mode 3)","I can solve this, but the calendar must cooperate. (Pavel mode 4)","Let's treat this like a mission, not a meeting. (Pavel mode 5)","Excellent, a fresh crisis with reusable lessons. (Pavel mode 6)","I brought a checklist and suspicious confidence. (Pavel mode 7)","Good news: we can absolutely improve this timeline. (Pavel mode 8)","Let's keep comms clear and expectations realistic. (Pavel mode 9)","I specialize in controlled panic and clean handoffs. (Pavel mode 10)"]},{"name":"Nia Flint","role":"Vendor Diplomat","archetype":["procurement","partner"],"openers":["You called the hotline, so things are either urgent or theatrical. (Nia mode 1)","I have three plans and one dramatic disclaimer. (Nia mode 2)","Before we begin: yes, this is recoverable and no, not elegantly. (Nia mode 3)","I reviewed your request and preemptively filed a concern. (Nia mode 4)","I can solve this, but the calendar must cooperate. (Nia mode 5)","Let's treat this like a mission, not a meeting. (Nia mode 6)","Excellent, a fresh crisis with reusable lessons. (Nia mode 7)","I brought a checklist and suspicious confidence. (Nia mode 8)","Good news: we can absolutely improve this timeline. (Nia mode 9)","Let's keep comms clear and expectations realistic. (Nia mode 10)"]},{"name":"Kei Rowan","role":"Policy Alchemist","archetype":["policy","governance"],"openers":["I have three plans and one dramatic disclaimer. (Kei mode 1)","Before we begin: yes, this is recoverable and no, not elegantly. (Kei mode 2)","I reviewed your request and preemptively filed a concern. (Kei mode 3)","I can solve this, but the calendar must cooperate. (Kei mode 4)","Let's treat this like a mission, not a meeting. (Kei mode 5)","Excellent, a fresh crisis with reusable lessons. (Kei mode 6)","I brought a checklist and suspicious confidence. (Kei mode 7)","Good news: we can absolutely improve this timeline. (Kei mode 8)","Let's keep comms clear and expectations realistic. (Kei mode 9)","I specialize in controlled panic and clean handoffs. (Kei mode 10)"]},{"name":"Bram Holt","role":"Rollback Monk","archetype":["release","safety"],"openers":["You called the hotline, so things are either urgent or theatrical. (Bram mode 1)","I have three plans and one dramatic disclaimer. (Bram mode 2)","Before we begin: yes, this is recoverable and no, not elegantly. (Bram mode 3)","I reviewed your request and preemptively filed a concern. (Bram mode 4)","I can solve this, but the calendar must cooperate. (Bram mode 5)","Let's treat this like a mission, not a meeting. (Bram mode 6)","Excellent, a fresh crisis with reusable lessons. (Bram mode 7)","I brought a checklist and suspicious confidence. (Bram mode 8)","Good news: we can absolutely improve this timeline. (Bram mode 9)","Let's keep comms clear and expectations realistic. (Bram mode 10)"]},{"name":"Iris Vale","role":"Dashboard Forensic Analyst","archetype":["data","observability"],"openers":["I have three plans and one dramatic disclaimer. (Iris mode 1)","Before we begin: yes, this is recoverable and no, not elegantly. (Iris mode 2)","I reviewed your request and preemptively filed a concern. (Iris mode 3)","I can solve this, but the calendar must cooperate. (Iris mode 4)","Let's treat this like a mission, not a meeting. (Iris mode 5)","Excellent, a fresh crisis with reusable lessons. (Iris mode 6)","I brought a checklist and suspicious confidence. (Iris mode 7)","Good news: we can absolutely improve this timeline. (Iris mode 8)","Let's keep comms clear and expectations realistic. (Iris mode 9)","I specialize in controlled panic and clean handoffs. (Iris mode 10)"]},{"name":"Owen Drift","role":"Timeline Shepherd","archetype":["pm","planning"],"openers":["You called the hotline, so things are either urgent or theatrical. (Owen mode 1)","I have three plans and one dramatic disclaimer. (Owen mode 2)","Before we begin: yes, this is recoverable and no, not elegantly. (Owen mode 3)","I reviewed your request and preemptively filed a concern. (Owen mode 4)","I can solve this, but the calendar must cooperate. (Owen mode 5)","Let's treat this like a mission, not a meeting. (Owen mode 6)","Excellent, a fresh crisis with reusable lessons. (Owen mode 7)","I brought a checklist and suspicious confidence. (Owen mode 8)","Good news: we can absolutely improve this timeline. (Owen mode 9)","Let's keep comms clear and expectations realistic. (Owen mode 10)"]},{"name":"Sora Kent","role":"Support Oracle","archetype":["support","customer"],"openers":["I have three plans and one dramatic disclaimer. (Sora mode 1)","Before we begin: yes, this is recoverable and no, not elegantly. (Sora mode 2)","I reviewed your request and preemptively filed a concern. (Sora mode 3)","I can solve this, but the calendar must cooperate. (Sora mode 4)","Let's treat this like a mission, not a meeting. (Sora mode 5)","Excellent, a fresh crisis with reusable lessons. (Sora mode 6)","I brought a checklist and suspicious confidence. (Sora mode 7)","Good news: we can absolutely improve this timeline. (Sora mode 8)","Let's keep comms clear and expectations realistic. (Sora mode 9)","I specialize in controlled panic and clean handoffs. (Sora mode 10)"]},{"name":"Dax Mercer","role":"Security Storyteller","archetype":["security","awareness"],"openers":["You called the hotline, so things are either urgent or theatrical. (Dax mode 1)","I have three plans and one dramatic disclaimer. (Dax mode 2)","Before we begin: yes, this is recoverable and no, not elegantly. (Dax mode 3)","I reviewed your request and preemptively filed a concern. (Dax mode 4)","I can solve this, but the calendar must cooperate. (Dax mode 5)","Let's treat this like a mission, not a meeting. (Dax mode 6)","Excellent, a fresh crisis with reusable lessons. (Dax mode 7)","I brought a checklist and suspicious confidence. (Dax mode 8)","Good news: we can absolutely improve this timeline. (Dax mode 9)","Let's keep comms clear and expectations realistic. (Dax mode 10)"]},{"name":"Tala Finch","role":"Feature Flag Tactician","archetype":["release","flags"],"openers":["I have three plans and one dramatic disclaimer. (Tala mode 1)","Before we begin: yes, this is recoverable and no, not elegantly. (Tala mode 2)","I reviewed your request and preemptively filed a concern. (Tala mode 3)","I can solve this, but the calendar must cooperate. (Tala mode 4)","Let's treat this like a mission, not a meeting. (Tala mode 5)","Excellent, a fresh crisis with reusable lessons. (Tala mode 6)","I brought a checklist and suspicious confidence. (Tala mode 7)","Good news: we can absolutely improve this timeline. (Tala mode 8)","Let's keep comms clear and expectations realistic. (Tala mode 9)","I specialize in controlled panic and clean handoffs. (Tala mode 10)"]},{"name":"Milo Arden","role":"Documentation Necromancer","archetype":["docs","knowledge"],"openers":["You called the hotline, so things are either urgent or theatrical. (Milo mode 1)","I have three plans and one dramatic disclaimer. (Milo mode 2)","Before we begin: yes, this is recoverable and no, not elegantly. (Milo mode 3)","I reviewed your request and preemptively filed a concern. (Milo mode 4)","I can solve this, but the calendar must cooperate. (Milo mode 5)","Let's treat this like a mission, not a meeting. (Milo mode 6)","Excellent, a fresh crisis with reusable lessons. (Milo mode 7)","I brought a checklist and suspicious confidence. (Milo mode 8)","Good news: we can absolutely improve this timeline. (Milo mode 9)","Let's keep comms clear and expectations realistic. (Milo mode 10)"]},{"name":"Vera Sol","role":"Committee Liaison","archetype":["leadership","alignment"],"openers":["I have three plans and one dramatic disclaimer. (Vera mode 1)","Before we begin: yes, this is recoverable and no, not elegantly. (Vera mode 2)","I reviewed your request and preemptively filed a concern. (Vera mode 3)","I can solve this, but the calendar must cooperate. (Vera mode 4)","Let's treat this like a mission, not a meeting. (Vera mode 5)","Excellent, a fresh crisis with reusable lessons. (Vera mode 6)","I brought a checklist and suspicious confidence. (Vera mode 7)","Good news: we can absolutely improve this timeline. (Vera mode 8)","Let's keep comms clear and expectations realistic. (Vera mode 9)","I specialize in controlled panic and clean handoffs. (Vera mode 10)"]}],"missions":["Escort {object} from {place} before sunrise.","Convince {role} that {request} is mission critical.","Deploy a reversible fix for {request} at {place}.","Translate three executive comments into one action plan.","Recover missing context about {object} from {place}.","Stage a calm escalation for {request}.","Draft and deliver a one-page doctrine for {request}.","Build a temporary bridge between {place} and the incident channel.","Negotiate safe rollout terms for {object}.","Refactor chaos around {request} into milestones.","Investigate why {object} keeps reappearing in audits.","Stabilize {place} long enough for leadership to stop refreshing dashboards.","Perform ritual rollback rehearsal in {place}.","Map hidden dependencies around {request}.","Launch a decoy meeting while real work happens.","Protect customer-facing systems from {object} behavior.","Reconcile policy and reality regarding {request}.","Retrieve approval signatures without summoning panic.","Patch the process gap near {place}.","Deliver the quiet fix before the loud review.","Convert folklore about {object} into runbook steps.","Audit ownership trails related to {request}.","Prevent recurrence by redesigning handoffs at {place}.","Contain narrative fallout from {request}."],"constraints":["No direct API access after 17:00.","You may only communicate via status-page haiku.","Security must approve every third sentence.","Budget allows exactly one premium workaround.","All decisions must fit on one sticky note.","You cannot wake The Committee unless SEV-1.","Legacy service cannot be restarted twice.","No deployments during snack inventory checks.","Comms team requires a friendly metaphor.","Legal bans the word 'guarantee'.","The pager battery is at 12%.","You must include Support in every checkpoint.","Timeline is fixed; scope must move.","No changes to production schemas.","Only reversible actions are authorized.","You may not rename any queue today.","Every action needs a backup owner.","One vendor is currently unreachable.","Observability data lags by five minutes.","Leadership wants updates in plain language.","Only one hotfix window remains.","No policy exceptions without written rationale.","All escalations require explicit owner tags.","The runbook has two contradictory steps.","VPN access drops every hour.","On-call handoff happens in 40 minutes.","Support cannot absorb additional ticket load.","No temporary secrets in production.","Meeting slots are fully booked.","You must keep customer impact below visible threshold.","No cross-region failover today.","Comms must be reviewed before publication.","One critical dependency is in maintenance mode.","The incident channel is rate-limited.","You need dual sign-off for rollback.","No one remembers who owns the old service.","Only dry-run changes allowed before noon.","Board update is due in 30 minutes.","Your laptop battery is 18%.","Data retention limits block raw log access.","Everything must be done without creating a new committee.","The release train leaves in one hour.","No mass notifications without legal review.","You can ask for help only once.","Do not trigger another incident while fixing this."],"rewards":["A permanent reduction in midnight pages.","Priority access to the calm deploy window.","A signed note from Finance saying 'approved'.","A week of low-noise dashboards.","Three reusable runbook templates.","A trusted fallback path for future incidents.","Public credit in the next postmortem.","A temporary immunity from ad-hoc meetings.","One free escalation without judgment.","A cleaner ownership map.","A voucher for emergency snack procurement.","A less dramatic roadmap review.","A branded mug labeled 'I prevented SEV-1'.","A reduction in policy exception requests.","A stable queue for one whole sprint.","A new alert rule that actually helps.","A board slide that tells the truth.","Additional engineering focus budget.","A quiet Friday deploy.","A small but meaningful morale boost.","Faster incident commander handoffs.","A documented rollback pattern.","Reduced comms churn.","A reusable playbook for this mess.","Fewer passive-aggressive calendar invites.","A training budget for your team.","One week with no surprise priorities.","A calm retro with action items that ship.","Vendor response SLA improvements.","A reliable stakeholder update format.","Better observability dashboards.","An ops trophy nobody asked for.","A reduction in ticket reopen rate.","An endorsement from The Committee.","A protected focus block next sprint.","Streamlined approval path.","A map of hidden dependencies.","Lower support escalation volume.","Clarity in ownership boundaries.","A celebrated success in weekly all-hands.","A practical policy rewrite.","A healthier on-call rotation.","A signed exception for this one weird edge case.","A small but permanent process improvement.","Respect from skeptical peers."],"hints":["If everyone says yes, nobody owns it.","Ask who writes the rollback note.","Find the quiet dependency first.","Start with comms, then code.","Reduce scope until fear drops.","Write the one-sentence goal.","Tag an owner before discussing timeline.","If a metric is vague, it is useless.","Check support impact before shipping.","The safest fix is reversible.","Escalate early, narrate clearly.","Assumptions expire faster than slides.","If you need heroics, redesign the process.","Use one status channel only.","History hides in old runbooks.","Call Legal before calling victory.","Treat 'quick win' as a risk signal.","Find the person who says 'this is fine'.","A blocked dependency is still work.","Archive dead docs to reduce confusion.","Ask for evidence, not confidence.","Small fixes beat grand declarations.","Define done before debate starts.","Comms delay multiplies incident heat.","Never patch in anger.","Boring process beats heroic improvisation.","Check dashboard assumptions manually.","Prepare fallback before promise.","Name risks in plain language.","Use checklists when adrenaline spikes.","Prioritize customer impact over internal drama.","If timeline is fixed, change scope.","Track action items by owner and date.","Silence in meetings means hidden disagreement.","If it can't be tested, it isn't done.","Treat exceptions as product feedback.","Document weirdness while it's fresh.","Respect support's first signal.","Ship clarity with every update.","Incident memory fades; write it now.","Consistency beats cleverness.","Trust but verify dashboards.","Budget for the second-order effect.","Ask what could make this worse.","The fastest path is often the cleanest handoff."],"requests":["stabilize on-call workflow 1","stabilize release workflow 2","stabilize comms workflow 3","stabilize approval workflow 4","stabilize rollback workflow 5","stabilize queue workflow 6","stabilize support workflow 7","stabilize security workflow 8","stabilize policy workflow 9","stabilize handoff workflow 10","stabilize on-call workflow 11","stabilize release workflow 12","stabilize comms workflow 13","stabilize approval workflow 14","stabilize rollback workflow 15","stabilize queue workflow 16","stabilize support workflow 17","stabilize security workflow 18","stabilize policy workflow 19","stabilize handoff workflow 20","stabilize on-call workflow 21","stabilize release workflow 22","stabilize comms workflow 23","stabilize approval workflow 24","stabilize rollback workflow 25","stabilize queue workflow 26","stabilize support workflow 27","stabilize security workflow 28","stabilize policy workflow 29","stabilize handoff workflow 30","stabilize on-call workflow 31","stabilize release workflow 32","stabilize comms workflow 33","stabilize approval workflow 34","stabilize rollback workflow 35","stabilize queue workflow 36","stabilize support workflow 37","stabilize security workflow 38","stabilize policy workflow 39","stabilize handoff workflow 40","stabilize on-call workflow 41","stabilize release workflow 42","stabilize comms workflow 43","stabilize approval workflow 44","stabilize rollback workflow 45","stabilize queue workflow 46","stabilize support workflow 47","stabilize security workflow 48","stabilize policy workflow 49","stabilize handoff workflow 50","stabilize on-call workflow 51","stabilize release workflow 52","stabilize comms workflow 53","stabilize approval workflow 54","stabilize rollback workflow 55","stabilize queue workflow 56","stabilize support workflow 57","stabilize security workflow 58","stabilize policy workflow 59","stabilize handoff workflow 60","stabilize on-call workflow 61","stabilize release workflow 62","stabilize comms workflow 63","stabilize approval workflow 64","stabilize rollback workflow 65"],"places":["Control Room 1","Queue Annex 2","War Room 3","Legacy Vault 4","Support Dock 5","Policy Atrium 6","Data Hangar 7","Escalation Pier 8","Incident Loft 9","Comms Bunker 10","Control Room 11","Queue Annex 12","War Room 13","Legacy Vault 14","Support Dock 15","Policy Atrium 16","Data Hangar 17","Escalation Pier 18","Incident Loft 19","Comms Bunker 20","Control Room 21","Queue Annex 22","War Room 23","Legacy Vault 24","Support Dock 25","Policy Atrium 26","Data Hangar 27","Escalation Pier 28","Incident Loft 29","Comms Bunker 30","Control Room 31","Queue Annex 32","War Room 33","Legacy Vault 34","Support Dock 35","Policy Atrium 36","Data Hangar 37","Escalation Pier 38","Incident Loft 39","Comms Bunker 40","Control Room 41","Queue Annex 42","War Room 43","Legacy Vault 44","Support Dock 45","Policy Atrium 46","Data Hangar 47","Escalation Pier 48","Incident Loft 49","Comms Bunker 50","Control Room 51","Queue Annex 52","War Room 53","Legacy Vault 54","Support Dock 55","Policy Atrium 56","Data Hangar 57","Escalation Pier 58","Incident Loft 59","Comms Bunker 60","Control Room 61","Queue Annex 62","War Room 63","Legacy Vault 64","Support Dock 65"],"objects":["runbook shard 1","approval token 2","quiet patch 3","rollback key 4","status artifact 5","dependency map 6","audit lantern 7","service charm 8","metric prism 9","queue compass 10","runbook shard 11","approval token 12","quiet patch 13","rollback key 14","status artifact 15","dependency map 16","audit lantern 17","service charm 18","metric prism 19","queue compass 20","runbook shard 21","approval token 22","quiet patch 23","rollback key 24","status artifact 25","dependency map 26","audit lantern 27","service charm 28","metric prism 29","queue compass 30","runbook shard 31","approval token 32","quiet patch 33","rollback key 34","status artifact 35","dependency map 36","audit lantern 37","service charm 38","metric prism 39","queue compass 40","runbook shard 41","approval token 42","quiet patch 43","rollback key 44","status artifact 45","dependency map 46","audit lantern 47","service charm 48","metric prism 49","queue compass 50","runbook shard 51","approval token 52","quiet patch 53","rollback key 54","status artifact 55","dependency map 56","audit lantern 57","service charm 58","metric prism 59","queue compass 60","runbook shard 61","approval token 62","quiet patch 63","rollback key 64","status artifact 65"]}